app/Controllers/admin.php

SELECT *
FROM `lomba`
---
    public function tambah_lomba()
    {
        $getInput = $this->lombaModel->findAll();

SELECT *
FROM `lomba`
---
    public function edit($id)
    {
        $getInput = $this->lombaModel->findAll();