app/Controllers/tambah_lomba.php

    public function index()
    {

        // d($this->request->getVar('keyword'));
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $orang = $this->lombaModel->search($keyword);
        } else {
            $orang = $this->lombaModel;
        }

        $getInput = $this->lombaModel->getInput()->getResultArray();
---
SELECT *
FROM `lomba`