app/Models/inputModel.php

SELECT *
FROM `input_mahasiswa`
WHERE `id` = 'assets'
---
    public function editInput($data, $id)
    {
        $builder = $this->db->table('input_mahasiswa')
            ->where('id', $id)
            ->update($data, $id);

SELECT count(*) as jumlah, `kelas`
FROM `input_mahasiswa`
GROUP BY `kelas`
---
    public function kelas_mhs()
    {
        return $this->db->table('input_mahasiswa')
            ->select('count(*) as jumlah,  kelas')->groupBy('kelas')
            ->get()->getResultArray();

SELECT count(*) as jumlah, `kategori`
FROM `input_mahasiswa`
GROUP BY `kategori`
---
    public function kategori_mahasiswa()
    {
        return $this->db->table('input_mahasiswa')
            ->select('count(*) as jumlah,  kategori')->groupBy('kategori')
            ->get()->getResultArray();