app/Models/lombaModel.php

SELECT `id`, TIMESTAMPDIFF(day, curdate(), Deadline) "curdate", `Title`, `link`, `Penyelenggara`, `Deadline`
FROM `lomba`
---
    public function getInput($id = false)
    {

        if ($id === false) {
            return $this->table('lomba')
            ->select('id, TIMESTAMPDIFF(day, curdate(), Deadline) "curdate", Title, link, Penyelenggara, Deadline')
            ->get();